<?php
fscanf(STDIN, '%d %d', $n, $y);

if ($n * 10000 === $y) { // 全て一万円
    echo "{$n} 0 0";
    exit;
} elseif ($n * 5000 === $y) { // 全て五千円
    echo "0 {$n} 0";
    exit;
} elseif ($n * 1000 === $y) { // 全て千円
    echo "0 0 {$n}";
    exit;
}
// $iを一万円の枚数としてnまでカウントする
for ($i = 0;$i <= $n;$i++) {
    for ($j = 0;$j <= $n - $i;$j++) {
        // 千円札は全体の枚数から一万円と五千円を引いた枚数
        $k = $n - ($i + $j);
        // 全ての合計値が入力値と等しい場合
        if ($i * 10000 + $j * 5000 + $k * 1000 === $y) {
            echo "{$i} {$j} {$k}";
            exit;
        }
    }
}
// 全てが等しくない場合
echo '-1 -1 -1';
